elites-messenger02/app/controllers/likes_controller.rb

    def create
        like = current_user.likes.build(like_param)
        # like = Like.new
        # likes.attributes = like_param
        # likes.user_id = current_user.id
        if like.valid?
            like.save!
---
INSERT INTO "likes" ("like_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["like_id", 2], ["user_id", 3], ["created_at", "2016-12-13 01:51:02.844808"], ["updated_at", "2016-12-13 01:51:02.844808"]]