elites-messenger02/app/controllers/timelines_controller.rb

SELECT  "timelines".* FROM "timelines" WHERE "timelines"."id" = ? LIMIT 1  [["id", 4]]
SELECT "timelines".* FROM "timelines" WHERE "timelines"."reply_id" IS NULL AND "timelines"."user_id" = ?  ORDER BY updated_at DESC  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
SELECT "users".* FROM "users"
SELECT "timelines".* FROM "timelines" WHERE "timelines"."reply_id" = ?  [["reply_id", 4]]
---
  def index
    @input_message = params[:id] ? Timeline.find(params[:id]) : Timeline.new
     # タイムラインを取得(降順)
    @timeline = Timeline.includes(:user).not_reply.user_filter(params[:filter_user_id]).order('updated_at DESC')
    @users = User.all
     if params[:reply_id]
        # 返信時は返信のタイムライン情報を取得
        @reply_timeline = Timeline.find(params[:reply_id])

INSERT INTO "timelines" ("message", "reply_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "Reply"], ["reply_id", 3], ["user_id", 1], ["created_at", "2016-12-05 07:55:09.082661"], ["updated_at", "2016-12-05 07:55:09.082661"]]
---
  def create
    timeline = Timeline.new
    timeline.attributes = input_message_param
    timeline.user_id = current_user.id
    if timeline.valid? # バリデーションチェック
      timeline.save!

SELECT  "timelines".* FROM "timelines" WHERE "timelines"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "timelines" SET "message" = ?, "updated_at" = ? WHERE "timelines"."id" = ?  [["message", "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\r\naaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\r\naaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"], ["updated_at", "2016-12-05 04:36:41.550223"], ["id", 4]]
---
  def update
    timeline = Timeline.find(params[:id])
    timeline.attributes = input_message_param
    if timeline.valid? # バリデーションチェック
      timeline.save!

SELECT  "timelines".* FROM "timelines" WHERE "timelines"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "timelines" WHERE "timelines"."id" = ?  [["id", 4]]
---
  def destroy
    timeline = Timeline.find(params[:id])
    timeline.destroy