elites-messenger02/app/views/timelines/_timeline.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."like_id" = ?  [["like_id", 2]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."like_id" = ?  [["like_id", 2]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
---
    <hr>
    <% if t.likes.count != 0 then%>
      <%= t.likes.count %> いいね！</br>
      <%= t.likes.map(&:user).map(&:name).join("と") %>がいいねと言っています。